/*
8分点ガウス・ルジャンドル公式
*/
#include <stdio.h>

/*
  8分点ガウス・ルジャンドル公式による数値積分計算関数
  [入力]
    a,b: 積分区間
    f: 関数ポインタ
  [返却値]
    数値積分値
*/
double glint(double a, double b, double (* f)(double))
{
  /* 分点数 */
  int n = 8;

  /* 分点 */
  double x[] = {-0.9602898564975365,-0.796666477413627,-0.525532409916329,-0.1834346424956498,
               0.1834346424956498,0.5255324099163291,0.7966664774136265,0.9602898564975361};
  /* 重み */
  double c[] = {0.1012285362903728,0.2223810344533736,0.3137066458778873,0.362683783378362,
              0.362683783378362,0.3137066458778879,0.2223810344533753,0.1012285362903782};
  /* [演習] 8分点ガウス・ルジャンドル型積分公式による数値積分計算関数を完成させてください */
}
